app/views/entries/show.html.erb

    <aside class="col-md-4">
      <% user=User.find(@entry.user_id)%>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]