app/views/users/show.html.erb

	<!--check if user have any entries-->
    <% if @user.entries.any? %>
---
SELECT  1 AS one FROM "entries"  WHERE "entries"."user_id" = ? LIMIT 1  [["user_id", 1]]