app/views/shared/_user_info.html.erb

<!--show the entrie the user have-->
<span><%= pluralize(current_user.entries.count, "entry") %></span>
---
SELECT COUNT(*) FROM "entries"  WHERE "entries"."user_id" = ?  [["user_id", 1]]