app/controllers/comments_controller.rb

def create
	#declare variable to get entries from current user entries
	@comment = current_user.comments.build comment_params
	#if save success
	if @comment.save
		#show message to user
		flash[:success]="Comment create"
		#link to root path
		redirect_to Entry.find(params[:comment][:entry_id])
---
INSERT INTO "comments" ("content", "created_at", "entry_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "test hehe"], ["created_at", "2015-01-15 16:38:09.287547"], ["entry_id", 1], ["updated_at", "2015-01-15 16:38:09.287547"], ["user_id", 1]]
SELECT  "entries".* FROM "entries"  WHERE "entries"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]