app/controllers/entries_controller.rb

def create
	@entry=current_user.entries.build(entry_params)
	if @entry.save
---
INSERT INTO "entries" ("body", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "hehe"], ["created_at", "2015-01-15 08:53:47.153835"], ["title", "otoke"], ["updated_at", "2015-01-15 08:53:47.153835"], ["user_id", 1]]

def show
	@entry=Entry.find(params[:id])
    @comments = @entry.comments.paginate(page: params[:page])
---
SELECT  "entries".* FROM "entries"  WHERE "entries"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."entry_id" = ?  ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["entry_id", 1]]