app/controllers/home_pages_controller.rb

  def home
    if signed_in?
  	  @entry=current_user.entries.build
      @feed_items=current_user.feed.paginate(page: params[:page])
---
SELECT  "entries".* FROM "entries"  WHERE (user_id IN (SELECT followed_id FROM relationships WHERE  follower_id = 1) OR user_id = 1)  ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "entries"  WHERE (user_id IN (SELECT followed_id FROM relationships WHERE  follower_id = 1) OR user_id = 1)

  def all_entries
      entries=Entry.all
      @feed_items=entries.paginate(page: params[:page])
---
SELECT  "entries".* FROM "entries"   ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "entries"