app/controllers/users_controller.rb

  def show
  	@user=User.find(params[:id])
    @entries = @user.entries.paginate(page: params[:page])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "entries".* FROM "entries"  WHERE "entries"."user_id" = ?  ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "entries"  WHERE "entries"."user_id" = ?  [["user_id", 1]]

  def create
  	@user = User.new(user_params)
  	if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)